Конфигурация/DataProcessors/ИмпортКотировокММВБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ИмпортКотировокММВБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИмпорта</Name>
					<Comment>0 - поиск расхождений, 1 - импорт новых котировок, 2 - устранения расхождений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьВОтчетеНовыеКотировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
					<Comment>Служебное поле, не использовать для работы</Comment>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсключаемыеРежимыТоргов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРежимыТоргов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/DataProcessors/ИмпортКотировокММВБ/Ext/ManagerModule.bsl
Процедура ИмпортироватьКотировкиПоНовымЦеннымБумагам(ЦеннаяБумага, Источник = Неопределено) Экспорт
	
	КонДатаПериода = ТекущаяДатаСеанса();
	
	НачДатаПериода = Справочники.Календари.ДобавитьКДатеРабочиеДни(
		Константы.ОсновнойКалендарьКотировок.Получить(),
		КонДатаПериода,
		-92);
	
	ИмпортКотировокММВБ = Обработки.ИмпортКотировокММВБ.Создать();
	ИмпортКотировокММВБ.Период       = Новый СтандартныйПериод(НачДатаПериода, КонДатаПериода);
	ИмпортКотировокММВБ.РежимИмпорта = 1; // только импорт новых 
	ИмпортКотировокММВБ.ЦеннаяБумага = ЦеннаяБумага;
	
	Если ЗначениеЗаполнено(Источник) Тогда
		ИмпортКотировокММВБ.ДополнительныеСвойства.Вставить("Источник", Источник);
	КонецЕсли;
	
	ИмпортКотировокММВБ.СкрыватьВОтчетеНовыеКотировки = Истина;
	
	ИмпортКотировокММВБ.ИмпортироватьКотировки();
	
КонецПроцедуры
